holdtao/S32K144cmake/RTD/base_include/S32K118_M0.svd
        <register>
          <name>INT</name>
          <description>Interrupt Request Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INT0</name>
              <description>Interrupt Request 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT0_0</name>
                  <description>The interrupt request for corresponding channel is cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT0_1</name>
                  <description>The interrupt request for corresponding channel is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT1</name>
              <description>Interrupt Request 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT1_0</name>
                  <description>The interrupt request for corresponding channel is cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT1_1</name>
                  <description>The interrupt request for corresponding channel is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT2</name>
              <description>Interrupt Request 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT2_0</name>
                  <description>The interrupt request for corresponding channel is cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT2_1</name>
                  <description>The interrupt request for corresponding channel is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT3</name>
              <description>Interrupt Request 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT3_0</name>
                  <description>The interrupt request for corresponding channel is cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT3_1</name>
                  <description>The interrupt request for corresponding channel is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR</name>
          <description>Error Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERR0</name>
              <description>Error In Channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERR0_0</name>
                  <description>An error in this channel has not occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR0_1</name>
                  <description>An error in this channel has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERR1</name>
              <description>Error In Channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERR1_0</name>
                  <description>An error in this channel has not occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR1_1</name>
                  <description>An error in this channel has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERR2</name>
              <description>Error In Channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERR2_0</name>
                  <description>An error in this channel has not occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR2_1</name>
                  <description>An error in this channel has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERR3</name>
              <description>Error In Channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERR3_0</name>
                  <description>An error in this channel has not occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR3_1</name>
                  <description>An error in this channel has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HRS</name>
          <description>Hardware Request Status Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HRS0</name>
              <description>Hardware Request Status Channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS0_0</name>
                  <description>A hardware service request for channel 0 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS0_1</name>
                  <description>A hardware service request for channel 0 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS1</name>
              <description>Hardware Request Status Channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS1_0</name>
                  <description>A hardware service request for channel 1 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS1_1</name>
                  <description>A hardware service request for channel 1 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS2</name>
              <description>Hardware Request Status Channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS2_0</name>
                  <description>A hardware service request for channel 2 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS2_1</name>
                  <description>A hardware service request for channel 2 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS3</name>
              <description>Hardware Request Status Channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS3_0</name>
                  <description>A hardware service request for channel 3 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS3_1</name>
                  <description>A hardware service request for channel 3 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EARS</name>
          <description>Enable Asynchronous Request in Stop Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDREQ_0</name>
              <description>Enable asynchronous DMA request in stop mode for channel 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_0_0</name>
                  <description>Disable asynchronous DMA request for channel 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_0_1</name>
                  <description>Enable asynchronous DMA request for channel 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_1</name>
              <description>Enable asynchronous DMA request in stop mode for channel 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_1_0</name>
                  <description>Disable asynchronous DMA request for channel 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_1_1</name>
                  <description>Enable asynchronous DMA request for channel 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_2</name>
              <description>Enable asynchronous DMA request in stop mode for channel 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_2_0</name>
                  <description>Disable asynchronous DMA request for channel 2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_2_1</name>
                  <description>Enable asynchronous DMA request for channel 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_3</name>
              <description>Enable asynchronous DMA request in stop mode for channel 3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_3_0</name>
                  <description>Disable asynchronous DMA request for channel 3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_3_1</name>
                  <description>Enable asynchronous DMA request for channel 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCHPRI3</name>
          <description>Channel Priority Register</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CHPRI</name>
              <description>Channel n Arbitration Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPA</name>
              <description>Disable Preempt Ability. This field resets to 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPA_0</name>
                  <description>Channel n can suspend a lower priority channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPA_1</name>
                  <description>Channel n cannot suspend any channel, regardless of channel priority.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECP</name>
              <description>Enable Channel Preemption. This field resets to 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECP_0</name>
                  <description>Channel n cannot be suspended by a higher priority channel's service request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECP_1</name>
                  <description>Channel n can be temporarily suspended by the service request of a higher priority channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCHPRI2</name>
          <description>Channel Priority Register</description>
          <addressOffset>0x101</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CHPRI</name>
              <description>Channel n Arbitration Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPA</name>
              <description>Disable Preempt Ability. This field resets to 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPA_0</name>
                  <description>Channel n can suspend a lower priority channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPA_1</name>
                  <description>Channel n cannot suspend any channel, regardless of channel priority.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECP</name>
              <description>Enable Channel Preemption. This field resets to 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECP_0</name>
                  <description>Channel n cannot be suspended by a higher priority channel's service request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECP_1</name>
                  <description>Channel n can be temporarily suspended by the service request of a higher priority channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCHPRI1</name>
          <description>Channel Priority Register</description>
          <addressOffset>0x102</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CHPRI</name>
              <description>Channel n Arbitration Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPA</name>
              <description>Disable Preempt Ability. This field resets to 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPA_0</name>
                  <description>Channel n can suspend a lower priority channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPA_1</name>
                  <description>Channel n cannot suspend any channel, regardless of channel priority.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECP</name>
              <description>Enable Channel Preemption. This field resets to 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECP_0</name>
                  <description>Channel n cannot be suspended by a higher priority channel's service request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECP_1</name>
                  <description>Channel n can be temporarily suspended by the service request of a higher priority channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
