holdtao/S32K144cmake/RTD/base_include/S32K118_M0.svd
        <register>
          <name>CLRTEN</name>
          <description>Clear Timer Enable Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLR_T_EN_0</name>
              <description>Clear Timer 0 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR_T_EN_0_0</name>
                  <description>No action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_T_EN_0_1</name>
                  <description>Clear the Timer Enable bit (TCTRL0[T_EN]) for Timer Channel 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR_T_EN_1</name>
              <description>Clear Timer 1 Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR_T_EN_1_0</name>
                  <description>No Action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_T_EN_1_1</name>
                  <description>Clear the Timer Enable bit (TCTRL1[T_EN]) for Timer Channel 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR_T_EN_2</name>
              <description>Clear Timer 2 Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR_T_EN_2_0</name>
                  <description>No Action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_T_EN_2_1</name>
                  <description>Clear the Timer Enable bit (TCTRL2[T_EN]) for Timer Channel 2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR_T_EN_3</name>
              <description>Clear Timer 3 Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR_T_EN_3_0</name>
                  <description>No Action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_T_EN_3_1</name>
                  <description>Clear the Timer Enable bit (TCTRL3[T_EN]) for Timer Channel 3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CHANNEL[%s]</name>
          <description>no description available</description>
          <addressOffset>0x20</addressOffset>
          <register>
            <name>TVAL</name>
            <description>Timer Value Register</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TMR_VAL</name>
                <description>Timer Value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TMR_VAL_0</name>
                    <description>Invalid load value in compare mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TMR_VAL_1</name>
                    <description>Invalid load value in compare mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TMR_VAL_2</name>
                    <description>In compare mode: the value to be loaded; in capture mode, the value of the timer</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TMR_VAL_3</name>
                    <description>In compare mode: the value to be loaded; in capture mode, the value of the timer</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TMR_VAL_4</name>
                    <description>In compare mode: the value to be loaded; in capture mode, the value of the timer</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TMR_VAL_5</name>
                    <description>In compare mode: the value to be loaded; in capture mode, the value of the timer</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TMR_VAL_6</name>
                    <description>In compare mode: the value to be loaded; in capture mode, the value of the timer</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TMR_VAL_7</name>
                    <description>In compare mode: the value to be loaded; in capture mode, the value of the timer</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TMR_VAL_8</name>
                    <description>In compare mode: the value to be loaded; in capture mode, the value of the timer</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TMR_VAL_9</name>
                    <description>In compare mode: the value to be loaded; in capture mode, the value of the timer</description>
                    <value>0x9</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CVAL</name>
            <description>Current Timer Value</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TMR_CUR_VAL</name>
                <description>Current Timer Value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TCTRL</name>
            <description>Timer Control Register</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>T_EN</name>
                <description>Timer Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>T_EN_0</name>
                    <description>Timer Channel is disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>T_EN_1</name>
                    <description>Timer Channel is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHAIN</name>
                <description>Chain Channel</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CHAIN_0</name>
                    <description>Channel Chaining is disabled. The channel timer runs independently.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CHAIN_1</name>
                    <description>Channel Chaining is enabled. The timer decrements on the previous channel's timeout.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MODE</name>
                <description>Timer Operation Mode</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MODE_0</name>
                    <description>32-bit Periodic Counter</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MODE_1</name>
                    <description>Dual 16-bit Periodic Counter</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MODE_2</name>
                    <description>32-bit Trigger Accumulator</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MODE_3</name>
                    <description>32-bit Trigger Input Capture</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TSOT</name>
                <description>Timer Start On Trigger</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TSOT_0</name>
                    <description>Timer starts to decrement immediately based on the restart condition (controlled by the Timer Stop On Interrupt bit (TSOI))</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TSOT_1</name>
                    <description>Timer starts to decrement when a rising edge on a selected trigger is detected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TSOI</name>
                <description>Timer Stop On Interrupt</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TSOI_0</name>
                    <description>The channel timer does not stop after timeout</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TSOI_1</name>
                    <description>The channel timer will stop after a timeout, and the channel timer will restart based on Timer Start On Trigger bit (TSOT). When TSOT = 0, the channel timer will restart after a rising edge on the Timer Enable bit (T_EN) is detected (which means that the timer channel is disabled and then enabled). When TSOT = 1, the channel timer will restart after a rising edge on the selected trigger is detected.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TROT</name>
                <description>Timer Reload On Trigger</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TROT_0</name>
                    <description>Timer will not reload on the selected trigger</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TROT_1</name>
                    <description>Timer will reload on the selected trigger</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRG_SRC</name>
                <description>Trigger Source</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TRG_SRC_0</name>
                    <description>Selects external triggers</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRG_SRC_1</name>
                    <description>Selects internal triggers</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRG_SEL</name>
                <description>Trigger Select</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TRG_SEL_0</name>
                    <description>Timer channel 0 - 3 trigger source is selected</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRG_SEL_1</name>
                    <description>Timer channel 0 - 3 trigger source is selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRG_SEL_2</name>
                    <description>Timer channel 0 - 3 trigger source is selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRG_SEL_3</name>
                    <description>Timer channel 0 - 3 trigger source is selected</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
