holdtao/S32K144cmake/RTD/base_include/S32K118_M0.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CMU0</name>
      <description>CMU_FC</description>
      <groupName>CMU</groupName>
      <headerStructName>CMU</headerStructName>
      <baseAddress>0x4003E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GCR</name>
          <description>Global Configuration Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FCE</name>
              <description>Frequency Check Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bfv_gcr_fce_0</name>
                  <description>Frequency check disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_gcr_fce_1</name>
                  <description>Frequency check enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RCCR</name>
          <description>Reference Count Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_CNT</name>
              <description>Reference clock count.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HTCR</name>
          <description>High Threshold Configuration Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HFREF</name>
              <description>High frequency reference threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTCR</name>
          <description>Low Threshold Configuration Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LFREF</name>
              <description>Low Frequency Reference Threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLL</name>
              <description>Frequency lower than low frequency reference threshold event status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bfv_sr_fll_0</name>
                  <description>No FLL event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_sr_fll_1</name>
                  <description>FLL event captured</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FHH</name>
              <description>Frequency higher than high frequency reference threshold event status.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bfv_sr_fhh_0</name>
                  <description>No FHH event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_sr_fhh_1</name>
                  <description>FHH event occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATE</name>
              <description>Module state</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bfv_sr_state_0</name>
                  <description>Configure state: Configuration of registers and IER programming are in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_sr_state_1</name>
                  <description>Initialization state: Register configurations are being loaded internally.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_sr_state_2</name>
                  <description>Initialization wait state: CMU_FC stays in this state for one bus clock cycle.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_sr_state_3</name>
                  <description>Frequency check state: CMU_FC is ready to start frequency check operation in this state.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RS</name>
              <description>Run Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bfv_sr_rs_0</name>
                  <description>Frequency check stopped</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_sr_rs_1</name>
                  <description>Frequency check running</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLLAIE</name>
              <description>Frequency Lower than Low Frequency Reference Threshold Asynchronous Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bfv_ier_fllaie_0</name>
                  <description>Asynchronous FLL interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_ier_fllaie_1</name>
                  <description>Asynchronous FLL interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FHHAIE</name>
              <description>Frequency Higher than High Frequency Reference Threshold Asynchronous Interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bfv_ier_fhhaie_0</name>
                  <description>Asynchronous FHH interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_ier_fhhaie_1</name>
                  <description>Asynchronous FHH interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
