holdtao/S32K144cmake/RTD/base_include/S32K118_M0.svd
        <register>
          <name>LMFATR</name>
          <description>LMEM Fault Attribute Register</description>
          <addressOffset>0x494</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PEFPRT</name>
              <description>Parity/ECC Fault Protection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PEFSIZE</name>
              <description>Parity/ECC Fault Master Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEFSIZE_0</name>
                  <description>8-bit access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEFSIZE_1</name>
                  <description>16-bit access</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEFSIZE_2</name>
                  <description>32-bit access</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEFSIZE_3</name>
                  <description>64-bit access</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEFW</name>
              <description>Parity/ECC Fault Write</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PEFMST</name>
              <description>Parity/ECC Fault Master Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overrun</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMFDHR</name>
          <description>LMEM Fault Data High Register</description>
          <addressOffset>0x4A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PEFDH</name>
              <description>Parity or ECC Fault Data High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMFDLR</name>
          <description>LMEM Fault Data Low Register</description>
          <addressOffset>0x4A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PEFDL</name>
              <description>Parity or ECC Fault Data Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>